MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK20DX256ZVMD10/mcu.h
#define SDHC_DSADDR                   (*((volatile uint32_t *)0x400B1000))      // DMA System Address Register
#define SDHC_BLKATTR                  (*((volatile uint32_t *)0x400B1004))      // Block Attributes Register
#define SDHC_CMDARG                   (*((volatile uint32_t *)0x400B1008))      // Command Argument Register
#define SDHC_XFERTYP                  (*((volatile uint32_t *)0x400B100C))      // Transfer Type Register
#define SDHC_CMDRSP0                  (*((volatile uint32_t *)0x400B1010))      // Command Response 0
#define SDHC_CMDRSP1                  (*((volatile uint32_t *)0x400B1014))      // Command Response 1
#define SDHC_CMDRSP2                  (*((volatile uint32_t *)0x400B1018))      // Command Response 2
#define SDHC_CMDRSP3                  (*((volatile uint32_t *)0x400B101C))      // Command Response 3
#define SDHC_DATPORT                  (*((volatile uint32_t *)0x400B1020))      // Buffer Data Port Register
#define SDHC_PRSSTAT                  (*((volatile uint32_t *)0x400B1024))      // Present State Register
#define SDHC_PROCTL                   (*((volatile uint32_t *)0x400B1028))      // Protocol Control Register
#define SDHC_SYSCTL                   (*((volatile uint32_t *)0x400B102C))      // System Control Register
#define SDHC_IRQSTAT                  (*((volatile uint32_t *)0x400B1030))      // Interrupt Status Register
#define SDHC_IRQSTATEN                (*((volatile uint32_t *)0x400B1034))      // Interrupt Status Enable Register
#define SDHC_IRQSIGEN                 (*((volatile uint32_t *)0x400B1038))      // Interrupt Signal Enable Register
#define SDHC_AC12ERR                  (*((volatile uint32_t *)0x400B103C))      // Auto CMD12 Error Status Register
#define SDHC_HTCAPBLT                 (*((volatile uint32_t *)0x400B1040))      // Host Controller Capabilities
#define SDHC_WML                      (*((volatile uint32_t *)0x400B1044))      // Watermark Level Register
#define SDHC_FEVT                     (*((volatile uint32_t *)0x400B1050))      // Force Event Register
#define SDHC_ADMAES                   (*((volatile uint32_t *)0x400B1054))      // ADMA Error Status Register
#define SDHC_ADSADDR                  (*((volatile uint32_t *)0x400B1058))      // ADMA System Address Register
#define SDHC_VENDOR                   (*((volatile uint32_t *)0x400B10C0))      // Vendor Specific Register
#define SDHC_MMCBOOT                  (*((volatile uint32_t *)0x400B10C4))      // MMC Boot Register
#define SDHC_HOSTVER                  (*((volatile uint32_t *)0x400B10FC))      // Host Controller Version


//*****************************************************************************
//
// Integrated interchip sound (I2S) registers
//
//*****************************************************************************

#define I2S0_TX0                      (*((volatile uint32_t *)0x4002F000))      // I2S Transmit Data Registers 0 (I2S0_TX0)
#define I2S0_TX1                      (*((volatile uint32_t *)0x4002F004))      // I2S Transmit Data Registers 1 (I2S0_TX1)
#define I2S0_RX0                      (*((volatile uint32_t *)0x4002F008))      // I2S Receive Data Registers 0 (I2S0_RX0)
#define I2S0_RX1                      (*((volatile uint32_t *)0x4002F00C))      // I2S Receive Data Registers 1 (I2S0_RX1)
#define I2S0_CR                       (*((volatile uint32_t *)0x4002F010))      // I2S Control Register (I2S0_CR)
#define I2S0_ISR                      (*((volatile uint32_t *)0x4002F014))      // I2S Interrupt Status Register (I2S0_ISR)
#define I2S0_IER                      (*((volatile uint32_t *)0x4002F018))      // I2S Interrupt Enable Register (I2S0_IER)
#define I2S0_TCR                      (*((volatile uint32_t *)0x4002F01C))      // I2S Transmit Configuration Register (I2S0_TCR)
#define I2S0_RCR                      (*((volatile uint32_t *)0x4002F020))      // I2S Receive Configuration Register (I2S0_RCR)
#define I2S0_TCCR                     (*((volatile uint32_t *)0x4002F024))      // I2S Transmit Clock Control Registers (I2S0_TCCR)
#define I2S0_RCCR                     (*((volatile uint32_t *)0x4002F028))      // I2S Receive Clock Control Registers (I2S0_RCCR)
#define I2S0_FCSR                     (*((volatile uint32_t *)0x4002F02C))      // I2S FIFO Control/Status Register (I2S0_FCSR)
#define I2S0_ACNT                     (*((volatile uint32_t *)0x4002F038))      // I2S AC97 Control Register (I2S0_ACNT)
#define I2S0_ACADD                    (*((volatile uint32_t *)0x4002F03C))      // I2S AC97 Command Address Register (I2S0_ACADD)
#define I2S0_ACDAT                    (*((volatile uint32_t *)0x4002F040))      // I2S AC97 Command Data Register (I2S0_ACDAT)
#define I2S0_ATAG                     (*((volatile uint32_t *)0x4002F044))      // I2S AC97 Tag Register (I2S0_ATAG)
#define I2S0_TMSK                     (*((volatile uint32_t *)0x4002F048))      // I2S Transmit Time Slot Mask Register (I2S0_TMSK)
#define I2S0_RMSK                     (*((volatile uint32_t *)0x4002F04C))      // I2S Receive Time Slot Mask Register (I2S0_RMSK)
#define I2S0_ACCST                    (*((volatile uint32_t *)0x4002F050))      // I2S AC97 Channel Status Register (I2S0_ACCST)
#define I2S0_ACCEN                    (*((volatile uint32_t *)0x4002F054))      // I2S AC97 Channel Enable Register (I2S0_ACCEN)
#define I2S0_ACCDIS                   (*((volatile uint32_t *)0x4002F058))      // I2S AC97 Channel Disable Register (I2S0_ACCDIS)


//*****************************************************************************
//
// General purpose input/output (GPIO) registers
//
//*****************************************************************************

#define GPIOA_PDOR                    (*((volatile uint32_t *)0x0))      // Port Data Output Register (GPIOA_PDOR)
#define GPIOA_PSOR                    (*((volatile uint32_t *)0x4))      // Port Set Output Register (GPIOA_PSOR)
#define GPIOA_PCOR                    (*((volatile uint32_t *)0x8))      // Port Clear Output Register (GPIOA_PCOR)
#define GPIOA_PTOR                    (*((volatile uint32_t *)0xC))      // Port Toggle Output Register (GPIOA_PTOR)
#define GPIOA_PDIR                    (*((volatile uint32_t *)0x10))      // Port Data Input Register (GPIOA_PDIR)
#define GPIOA_PDDR                    (*((volatile uint32_t *)0x14))      // Port Data Direction Register (GPIOA_PDDR)
#define GPIOB_PDOR                    (*((volatile uint32_t *)0x40))      // Port Data Output Register (GPIOB_PDOR)
#define GPIOB_PSOR                    (*((volatile uint32_t *)0x44))      // Port Set Output Register (GPIOB_PSOR)
#define GPIOB_PCOR                    (*((volatile uint32_t *)0x48))      // Port Clear Output Register (GPIOB_PCOR)
#define GPIOB_PTOR                    (*((volatile uint32_t *)0x4C))      // Port Toggle Output Register (GPIOB_PTOR)
#define GPIOB_PDIR                    (*((volatile uint32_t *)0x50))      // Port Data Input Register (GPIOB_PDIR)
#define GPIOB_PDDR                    (*((volatile uint32_t *)0x54))      // Port Data Direction Register (GPIOB_PDDR)
#define GPIOC_PDOR                    (*((volatile uint32_t *)0x80))      // Port Data Output Register (GPIOC_PDOR)
#define GPIOC_PSOR                    (*((volatile uint32_t *)0x84))      // Port Set Output Register (GPIOC_PSOR)
#define GPIOC_PCOR                    (*((volatile uint32_t *)0x88))      // Port Clear Output Register (GPIOC_PCOR)
#define GPIOC_PTOR                    (*((volatile uint32_t *)0x8C))      // Port Toggle Output Register (GPIOC_PTOR)
#define GPIOC_PDIR                    (*((volatile uint32_t *)0x90))      // Port Data Input Register (GPIOC_PDIR)
#define GPIOC_PDDR                    (*((volatile uint32_t *)0x94))      // Port Data Direction Register (GPIOC_PDDR)
#define GPIOD_PDOR                    (*((volatile uint32_t *)0xC0))      // Port Data Output Register (GPIOD_PDOR)
#define GPIOD_PSOR                    (*((volatile uint32_t *)0xC4))      // Port Set Output Register (GPIOD_PSOR)
#define GPIOD_PCOR                    (*((volatile uint32_t *)0xC8))      // Port Clear Output Register (GPIOD_PCOR)
#define GPIOD_PTOR                    (*((volatile uint32_t *)0xCC))      // Port Toggle Output Register (GPIOD_PTOR)
#define GPIOD_PDIR                    (*((volatile uint32_t *)0xD0))      // Port Data Input Register (GPIOD_PDIR)
#define GPIOD_PDDR                    (*((volatile uint32_t *)0xD4))      // Port Data Direction Register (GPIOD_PDDR)
#define GPIOE_PDOR                    (*((volatile uint32_t *)0x100))      // Port Data Output Register (GPIOE_PDOR)
#define GPIOE_PSOR                    (*((volatile uint32_t *)0x104))      // Port Set Output Register (GPIOE_PSOR)
#define GPIOE_PCOR                    (*((volatile uint32_t *)0x108))      // Port Clear Output Register (GPIOE_PCOR)
#define GPIOE_PTOR                    (*((volatile uint32_t *)0x10C))      // Port Toggle Output Register (GPIOE_PTOR)
#define GPIOE_PDIR                    (*((volatile uint32_t *)0x110))      // Port Data Input Register (GPIOE_PDIR)
#define GPIOE_PDDR                    (*((volatile uint32_t *)0x114))      // Port Data Direction Register (GPIOE_PDDR)


//*****************************************************************************
//
// Touch sense input (TSI) registers
//
//*****************************************************************************

#define TSI0_GENCS                    (*((volatile uint32_t *)0x40045000))      // General Control and Status Register (TSI0_GENCS)
#define TSI0_SCANC                    (*((volatile uint32_t *)0x40045004))      // SCAN control register (TSI0_SCANC)
#define TSI0_PEN                      (*((volatile uint32_t *)0x40045008))      // Pin enable register (TSI0_PEN)
#define TSI0_STATUS                   (*((volatile uint32_t *)0x4004500C))      // Status Register (TSI0_STATUS)
#define TSI0_CNTR1                    (*((volatile uint32_t *)0x40045100))      // Counter Register (TSI0_CNTR1)
#define TSI0_CNTR3                    (*((volatile uint32_t *)0x40045104))      // Counter Register (TSI0_CNTR3)
#define TSI0_CNTR5                    (*((volatile uint32_t *)0x40045108))      // Counter Register (TSI0_CNTR5)
#define TSI0_CNTR7                    (*((volatile uint32_t *)0x4004510C))      // Counter Register (TSI0_CNTR7)
#define TSI0_CNTR9                    (*((volatile uint32_t *)0x40045110))      // Counter Register (TSI0_CNTR9)
#define TSI0_CNTR11                   (*((volatile uint32_t *)0x40045114))      // Counter Register (TSI0_CNTR11)
#define TSI0_CNTR13                   (*((volatile uint32_t *)0x40045118))      // Counter Register (TSI0_CNTR13)
#define TSI0_CNTR15                   (*((volatile uint32_t *)0x4004511C))      // Counter Register (TSI0_CNTR15)
#define TSI0_THRESHLD0                (*((volatile uint32_t *)0x40045120))      // Channel n threshold register (TSI0_THRESHLD0)
#define TSI0_THRESHLD1                (*((volatile uint32_t *)0x40045124))      // Channel n threshold register (TSI0_THRESHLD1)
#define TSI0_THRESHLD2                (*((volatile uint32_t *)0x40045128))      // Channel n threshold register (TSI0_THRESHLD2)
#define TSI0_THRESHLD3                (*((volatile uint32_t *)0x4004512C))      // Channel n threshold register (TSI0_THRESHLD3)
#define TSI0_THRESHLD4                (*((volatile uint32_t *)0x40045130))      // Channel n threshold register (TSI0_THRESHLD4)
#define TSI0_THRESHLD5                (*((volatile uint32_t *)0x40045134))      // Channel n threshold register (TSI0_THRESHLD5)
#define TSI0_THRESHLD6                (*((volatile uint32_t *)0x40045138))      // Channel n threshold register (TSI0_THRESHLD6)
#define TSI0_THRESHLD7                (*((volatile uint32_t *)0x4004513C))      // Channel n threshold register (TSI0_THRESHLD7)
#define TSI0_THRESHLD8                (*((volatile uint32_t *)0x40045140))      // Channel n threshold register (TSI0_THRESHLD8)
#define TSI0_THRESHLD9                (*((volatile uint32_t *)0x40045144))      // Channel n threshold register (TSI0_THRESHLD9)
#define TSI0_THRESHLD10               (*((volatile uint32_t *)0x40045148))      // Channel n threshold register (TSI0_THRESHLD10)
#define TSI0_THRESHLD11               (*((volatile uint32_t *)0x4004514C))      // Channel n threshold register (TSI0_THRESHLD11)
#define TSI0_THRESHLD12               (*((volatile uint32_t *)0x40045150))      // Channel n threshold register (TSI0_THRESHLD12)
#define TSI0_THRESHLD13               (*((volatile uint32_t *)0x40045154))      // Channel n threshold register (TSI0_THRESHLD13)
#define TSI0_THRESHLD14               (*((volatile uint32_t *)0x40045158))      // Channel n threshold register (TSI0_THRESHLD14)
#define TSI0_THRESHLD15               (*((volatile uint32_t *)0x4004515C))      // Channel n threshold register (TSI0_THRESHLD15)



//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

#define USBREGEN                      0x80000000      // USB voltage regulator enable
#define USBSTBY                       0x40000000      // USB voltage regulator in standby mode
#define MS                            0x00800000      // EzPort chip select pin state
#define OSC32KSEL                     0x00040000      // 32K oscillator clock select
#define RAMSIZE                       0x00078000      // RAM size


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define SDHCSRC                       0x60000000      // SDHC clock source select
#define I2SSRC                        0x06000000      // I2S master clock source select
#define USBSRC                        0x00040000      // USB clock source select
#define PLLFLLSEL                     0x00010000      // PLL/FLL clock select
#define TRACECLKSEL                   0x00001000      // Debug trace clock select
#define CMTUARTPAD                    0x00000800      // CMT/UART pad drive strength
#define FBSL                          0x00000300      // FlexBus security level
#define MCGCLKSEL                     0x00000001      // MCG clock select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

