MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK20DX256ZVMD10/mcu.h
#define FLTEP                         0x00000080      // Filter Type Enable Pin
#define FLTR                          0x00000040      // Filter Type
#define ACKISO                        0x00000020      // Acknowledge Isolation


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLASC register.
//
//*****************************************************************************

#define ASC                           0x00007F80      // Each bit in the ASC field indicates if there is a corresponding connection to the crossbar switch's slave input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PLAMC register.
//
//*****************************************************************************

#define AMC                           0x00007F80      // Each bit in the AMC field indicates if there is a corresponding connection to the AXBS master input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_SRAMAP register.
//
//*****************************************************************************

#define SRAMLWP                       0x40000000      // SRAM_L write protect
#define SRAMLAP                       0x60000000      // SRAM_L arbitration priority
#define SRAMUWP                       0x04000000      // SRAM_U write protect
#define SRAMUAP                       0x06000000      // SRAM_U arbitration priority


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ISR register.
//
//*****************************************************************************

#define NMI                           0x00000004      // Non-maskable interrupt pending
#define IRQ                           0x00000002      // Normal interrupt pending


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCC register.
//
//*****************************************************************************

#define ITDIS                         0x00000020      // ITM-to-TPIU disable
#define ETDIS                         0x00000010      // ETM-to-TPIU disable
#define RLRQ                          0x00000008      // Reload request
#define RSPT                          0x0000000C      // Response type
#define CNTEN                         0x00000001      // Counter enable


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBRL register.
//
//*****************************************************************************

#define RELOAD                        0x001FFC00      // Byte count reload value


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCNT register.
//
//*****************************************************************************

#define COUNTER                       0x001FFC00      // Byte count counter value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_PRSn register.
//
//*****************************************************************************

#define M7                            0x1C0000000      // Master 7 priority. Sets the arbitration priority for this port on the associated slave port.
#define M6                            0x1C000000      // Master 6 priority. Sets the arbitration priority for this port on the associated slave port.
#define M5                            0x01C00000      // Master 5 priority. Sets the arbitration priority for this port on the associated slave port.
#define M4                            0x001C0000      // Master 4 priority. Sets the arbitration priority for this port on the associated slave port.
#define M3                            0x0001C000      // Master 3 priority. Sets the arbitration priority for this port on the associated slave port.
#define M2                            0x00001C00      // Master 2 priority. Sets the arbitration priority for this port on the associated slave port.
#define M1                            0x000001C0      // Master 1 priority. Sets the arbitration priority for this port on the associated slave port.
#define M0                            0x0000001C      // Master 0 priority. Sets the arbitration priority for this port on the associated slave port.


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_CRSn register.
//
//*****************************************************************************

#define RO                            0x80000000      // Forces the slave ports CSRn and PRSn registers to be read-only. After set, only a hardware reset clears it.
#define HLP                           0x40000000      // Sets the initial arbitration priority for low power mode requests. Setting this bit will not effect the request for low power mode from attaining highest priority once it has control of the slave ports.
#define ARB                           0x00000600      // Selects the arbitration policy for the slave port.
#define PCTL                          0x00000060      // Determines the slave ports parking control. The low-power park feature results in an overall power savings if the slave port is not saturated. However, this forces an extra latency clock when any master tries to access the slave port while not in use because it is not parked on any master.
#define PARK                          0x0000001C      // Determines which master port the current slave port parks on when no masters are actively making requests and the PCTL bits are cleared.


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_MGPCRn register.
//
//*****************************************************************************

#define AULB                          0x0000001C      // Determines whether, and when, the crossbar switch arbitrates away the slave port the master owns when the master is performing undefined length burst accesses.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_CESR register.
//
//*****************************************************************************

#define SPERR                         0xF80000000      // Indicates a captured error in EARn and EDRn. This bit is set when the hardware detects an error and records the faulting address and attributes. It is cleared by writing one to it. If another error is captured at the exact same cycle as the write, the flag remains set. A find-first-one instruction (or equivalent) can detect the presence of a captured error.
#define Reserved                      0x00800000      // This read-only field is reserved and always has the value one.
#define HRL                           0x00780000      // Specifies the MPUs hardware and definition revision level. It can be read by software to determine the functional definition of the module.
#define NSP                           0x00007800      // Specifies the number of slave ports connected to the MPU.
#define NRGD                          0x00000780      // Indicates the number of region descriptors implemented in the MPU.
#define VLD                           0x00000001      // Signals the region descriptor is valid. Any write to RGDn_WORD02 clears this bit.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_EARn register.
//
//*****************************************************************************

#define EADDR                         0x7FFFFFFF80000000      // Indicates the reference address from slave port n that generated the access error


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_EDRn register.
//
//*****************************************************************************

#define EACD                          0x7FFF80000000      // Indicates the region descriptor with the access error.
#define EMN                           0x00000780      // Indicates the bus master that generated the access error.
#define EATTR                         0x00000038      // Indicates attribute information about the faulting reference.
#define ERW                           0x00000001      // Indicates the access type of the faulting reference.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD0 register.
//
//*****************************************************************************

#define SRTADDR                       0x3FFFFFF80000000      // Defines the most significant bits of the 0-modulo-32 byte start address of the memory region.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD1 register.
//
//*****************************************************************************

#define ENDADDR                       0x3FFFFFF80000000      // Defines the most significant bits of the 31-modulo-32 byte end address of the memory region.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD2 register.
//
//*****************************************************************************

#define M7RE                          0x80000000      // Bus master 7 read enable.
#define M7WE                          0x40000000      // Bus master 7 write enable
#define M6RE                          0x20000000      // Bus master 6 read enable.
#define M6WE                          0x10000000      // Bus master 6 write enable
#define M5RE                          0x08000000      // Bus master 5 read enable.
#define M5WE                          0x04000000      // Bus master 5 write enable
#define M4RE                          0x02000000      // Bus master 4 read enable.
#define M4WE                          0x01000000      // Bus master 4 write enable
#define M3SM                          0x00C00000      // Bus master 3 supervisor mode access control
#define M3UM                          0x00700000      // Bus master 3 user mode access control
#define M2SM                          0x00030000      // Bus master 2 supervisor mode access control
#define M2UM                          0x0001C000      // Bus master 2 user mode access control
#define M1SM                          0x00000C00      // Bus master 1 supervisor mode access control
#define M1UM                          0x00000700      // Bus master 1 user mode access control
#define M0SM                          0x00000030      // Bus master 0 supervisor mode access control
#define M0UM                          0x0000001C      // Bus master 0 user mode access control


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD3 register.
//
//*****************************************************************************

#define VLD                           0x00000001      // Signals the region descriptor is valid. Any write to RGDn_WORD02 clears this bit.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDAACn register.
//
//*****************************************************************************

#define M7RE                          0x80000000      // Bus master 7 read enable.
#define M7WE                          0x40000000      // Bus master 7 write enable
#define M6RE                          0x20000000      // Bus master 6 read enable.
#define M6WE                          0x10000000      // Bus master 6 write enable
#define M5RE                          0x08000000      // Bus master 5 read enable.
#define M5WE                          0x04000000      // Bus master 5 write enable
#define M4RE                          0x02000000      // Bus master 4 read enable.
#define M4WE                          0x01000000      // Bus master 4 write enable
#define M3SM                          0x00C00000      // Bus master 3 supervisor mode access control
#define M3UM                          0x00700000      // Bus master 3 user mode access control
#define M2SM                          0x00030000      // Bus master 2 supervisor mode access control
#define M2UM                          0x0001C000      // Bus master 2 user mode access control
#define M1SM                          0x00000C00      // Bus master 1 supervisor mode access control
#define M1UM                          0x00000700      // Bus master 1 user mode access control
#define M0SM                          0x00000030      // Bus master 0 supervisor mode access control
#define M0UM                          0x0000001C      // Bus master 0 user mode access control


//*****************************************************************************
//
// The following are defines for the bit fields in the DMAMUX_CHCFGn register.
//
//*****************************************************************************

#define ENBL                          0x00000080      // Channel enable
#define TRIG                          0x00000040      // Trigger configuration
#define SOURCE                        0x000007E0      // Source selection


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CR register.
//
//*****************************************************************************

#define CX                            0x00020000      // Cancel Transfer
#define ECX                           0x00010000      // Error Cancel Transfer
#define Reserved                      0x007F8000      // This read-only field is reserved and always has the value zero
#define EMLM                          0x00000080      // Enable Minor Loop Mapping
#define CLM                           0x00000040      // Continuous Link Mode
#define HALT                          0x00000020      // Halt DMA Operations
#define HOE                           0x00000010      // Halt On Error
#define ERCA                          0x00000004      // Enable Round Robin Channel Arbitration
#define EDBG                          0x00000002      // Enable Debug


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_ES register.
//
//*****************************************************************************

#define VLD                           0x80000000      // Logical OR of all ERR status bits
#define ECX                           0x00010000      // Transfer Cancelled
#define CPE                           0x00004000      // Channel Priority Error
#define ERRCHN                        0x00007800      // Error Channel Number or Cancelled Channel Number
#define SAE                           0x00000080      // Source Address Error
#define SOE                           0x00000040      // Source Offset Error
#define DAE                           0x00000020      // Destination Address Error
#define DOE                           0x00000010      // Destination Offset Error
#define NCE                           0x00000008      // NBYTES/CITER Configuration Error
#define SGE                           0x00000004      // Scatter/Gather Configuration Error
#define SBE                           0x00000002      // Source Bus Error
#define DBE                           0x00000001      // Destination Bus Error


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_ERQ register.
//
//*****************************************************************************

